Show / Hide Table of Contents
Class WarningMessage
Open Warning message
Inheritance
System.Object
OpenObject
OpenMessage
WarningMessage
Inherited Members
 OpenMessage.Create(MessageNumber, OpenObject, String, String, OpenMessage)
 OpenMessage.Number
 OpenMessage.InnerMessage
 OpenMessage.Description
 OpenMessage.Object
 OpenMessage.PropertyName
 OpenMessage.PropertyValue
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Message
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[DataContract]
public class WarningMessage : OpenMessage
Constructors
Improve this Doc   View Source
WarningMessage()
Constructor
Declaration
public WarningMessage()
Improve this Doc   View Source
WarningMessage(MessageNumber, OpenObject, String, String, OpenMessage)
Constructor
Declaration
public WarningMessage(MessageNumber number, OpenObject openObject, string propertyName, string description, OpenMessage innerMessage = null)
Parameters
 Type |  Name |  Description
 MessageNumber |  number
Number of the message
 OpenObject |  openObject
Affected object
 System.String |  propertyName
Affected property
 System.String |  description
Description of the message
 OpenMessage |  innerMessage
Inner message
Properties
Improve this Doc   View Source
Message
Gets the Message
Declaration
public override string Message { get; }
Property Value
 Type |  Description
 System.String
Overrides
OpenMessage.Message
 Improve this Doc
 View Source